Tekla.Structures.ModelInternal.EventHandlerWrapper


Tekla.Structures.ModelInternal.EventHandlerWrapper.Instance


Tekla.Structures.ModelInternal.EventHandlerWrapper.Functionality


Tekla.Structures.ModelInternal.EventHandlerWrapper.#ctor(Tekla.Structures.ModelInternal.IEventHandler,Tekla.Structures.Internal.WrapperFunctionalityBase)


Tekla.Structures.ModelInternal.EventHandlerWrapper.AddListener(Tekla.Structures.Model.IEvents)


Tekla.Structures.ModelInternal.EventHandlerWrapper.RemoveListener(Tekla.Structures.Model.IEvents)


Tekla.Structures.ModelInternal.EventHandlerWrapper.AddUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)


Tekla.Structures.ModelInternal.EventHandlerWrapper.RemoveUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)


Tekla.Structures.ModelInternal.EventHandlerWrapper.SubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Registers an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure

Tekla.Structures.ModelInternal.EventHandlerWrapper.UnsubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Unregisters an event listener to the event
eventName:  name of the event to unsubscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure